#### AreElementsValidIntersectingReferences Method (ICollection(ElementId))

---

|  |
| --- |
| PartMakerMethodToDivideVolumes Class   See Also |

Identifies if provided members are valid.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
  **Since:**  2013

# Syntax

| C# |
| --- |
| ``` public bool AreElementsValidIntersectingReferences( 	ICollection<ElementId> elementIds ) ``` |

| Visual Basic |
| --- |
| ``` Public Function AreElementsValidIntersectingReferences ( _ 	elementIds As ICollection(Of ElementId) _ ) As Boolean ``` |

| Visual C++ |
| --- |
| ``` public: bool AreElementsValidIntersectingReferences( 	ICollection<ElementId^>^ elementIds ) ``` |

#### Parameters

elementIds
:   Type:  System.Collections.Generic ICollection   ElementId
     Element ids to be tested for validity for intersecting references.

#### Return Value

True if all references are valid, false otherwise.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | A non-optional argument was null |

# See Also

PartMakerMethodToDivideVolumes Class

AreElementsValidIntersectingReferences Overload

Autodesk.Revit.DB Namespace